In [1]:
import pandas as pd
import sqlite3

In [2]:
df = pd.read_csv('../data/hiring_data.csv')

In [3]:
conn = sqlite3.connect('../outputs/hiring.db')

In [6]:
df.to_sql('hiring_data', conn, if_exists='replace', index=False)

1000

In [7]:
print("Data loaded into SQLite")

Data loaded into SQLite

lets make a funnel

In [9]:
query = """
SELECT
    COUNT(*) AS total_candidates,
    SUM(offer_accepted) AS offers_accepted,
    SUM(left_within_6_months) AS early_attrition
FROM hiring_data;
"""

pd.read_sql(query, conn)

   total_candidates  offers_accepted  early_attrition
0              1000              479              250

offer acceptance rate based on source

In [10]:
query = """
SELECT
    source,
    COUNT(*) AS total_candidates,
    ROUND(AVG(offer_accepted), 2) AS acceptance_rate
FROM hiring_data
GROUP BY source;
"""

pd.read_sql(query, conn)

        source  total_candidates  acceptance_rate
0  Career Page               199             0.42
1     LinkedIn               503             0.42
2     Referral               298             0.62

Attrition based on source

In [11]:
query = """
SELECT
    source,
    ROUND(AVG(left_within_6_months), 2) AS attrition_rate
FROM hiring_data
GROUP BY source;
"""

pd.read_sql(query, conn)

        source  attrition_rate
0  Career Page            0.26
1     LinkedIn            0.26
2     Referral            0.23